#![allow(bad_style)]

pub const LLVMDisassembler_VariantKind_None: u32 = 0;
pub const LLVMDisassembler_VariantKind_ARM_HI16: u32 = 1;
pub const LLVMDisassembler_VariantKind_ARM_LO16: u32 = 2;
pub const LLVMDisassembler_VariantKind_ARM64_PAGE: u32 = 1;
pub const LLVMDisassembler_VariantKind_ARM64_PAGEOFF: u32 = 2;
pub const LLVMDisassembler_VariantKind_ARM64_GOTPAGE: u32 = 3;
pub const LLVMDisassembler_VariantKind_ARM64_GOTPAGEOFF: u32 = 4;
pub const LLVMDisassembler_VariantKind_ARM64_TLVP: u32 = 5;
pub const LLVMDisassembler_VariantKind_ARM64_TLVOFF: u32 = 6;
pub const LLVMDisassembler_ReferenceType_InOut_None: u32 = 0;
pub const LLVMDisassembler_ReferenceType_In_Branch: u32 = 1;
pub const LLVMDisassembler_ReferenceType_In_PCrel_Load: u32 = 2;
pub const LLVMDisassembler_ReferenceType_In_ARM64_ADRP: u64 = 4294967297;
pub const LLVMDisassembler_ReferenceType_In_ARM64_ADDXri: u64 = 4294967298;
pub const LLVMDisassembler_ReferenceType_In_ARM64_LDRXui: u64 = 4294967299;
pub const LLVMDisassembler_ReferenceType_In_ARM64_LDRXl: u64 = 4294967300;
pub const LLVMDisassembler_ReferenceType_In_ARM64_ADR: u64 = 4294967301;
pub const LLVMDisassembler_ReferenceType_Out_SymbolStub: u32 = 1;
pub const LLVMDisassembler_ReferenceType_Out_LitPool_SymAddr: u32 = 2;
pub const LLVMDisassembler_ReferenceType_Out_LitPool_CstrAddr: u32 = 3;
pub const LLVMDisassembler_ReferenceType_Out_Objc_CFString_Ref: u32 = 4;
pub const LLVMDisassembler_ReferenceType_Out_Objc_Message: u32 = 5;

        DebugLoc: LLVMMetadataRef,
        Instr: LLVMValueRef,
    ) -> LLVMValueRef;
}
extern "C" {
    pub fn LLVMDIBuilderInsertDeclareAtEnd(
        Builder: LLVMDIBuilderRef,
        Storage: LLVMValueRef,
        VarInfo: LLVMMetadataRef,
        Expr: LLVMMetadataRef,
        DebugLoc: LLVMMetadataRef,
        Block: LLVMBasicBlockRef,
    ) -> LLVMValueRef;
}
extern "C" {
    pub fn LLVMDIBuilderInsertDbgValueBefore(
        Builder: LLVMDIBuilderRef,
        Val: LLVMValueRef,
        VarInfo: LLVMMetadataRef,
        Expr: LLVMMetadataRef,
        DebugLoc: LLVMMetadataRef,
        Instr: LLVMValueRef,
    ) -> LLVMValueRef;
}
extern "C" {
    pub fn LLVMDIBuilderInsertDbgValueAtEnd(
        Builder: LLVMDIBuilderRef,
        Val: LLVMValueRef,
        VarInfo: LLVMMetadataRef,
        Expr: LLVMMetadataRef,
        DebugLoc: LLVMMetadataRef,
        Block: LLVMBasicBlockRef,
    ) -> LLVMValueRef;
}
extern "C" {
    pub fn LLVMDIBuilderCreateAutoVariable(
        Builder: LLVMDIBuilderRef,
        Scope: LLVMMetadataRef,
        Name: *const ::std::os::raw::c_char,
        NameLen: size_t,
        File: LLVMMetadataRef,
        LineNo: ::std::os::raw::c_uint,
        Ty: LLVMMetadataRef,
        AlwaysPreserve: LLVMBool,
        Flags: LLVMDIFlags,
        AlignInBits: u32,
    ) -> LLVMMetadataRef;
}
extern "C" {
    pub fn LLVMDIBuilderCreateParameterVariable(
        Builder: LLVMDIBuilderRef,
        Scope: LLVMMetadataRef,
        Name: *const ::std::os::raw::c_char,
        NameLen: size_t,
        ArgNo: ::std::os::raw::c_uint,
        File: LLVMMetadataRef,
        LineNo: ::std::os::raw::c_uint,
        Ty: LLVMMetadataRef,
        AlwaysPreserve: LLVMBool,
        Flags: LLVMDIFlags,
    ) -> LLVMMetadataRef;
}
extern "C" {
    pub fn LLVMGetSubprogram(Func: LLVMValueRef) -> LLVMMetadataRef;
}
extern "C" {
    pub fn LLVMSetSubprogram(Func: LLVMValueRef, SP: LLVMMetadataRef);
}
extern "C" {
    pub fn LLVMDISubprogramGetLine(Subprogram: LLVMMetadataRef) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn LLVMInstructionGetDebugLoc(Inst: LLVMValueRef) -> LLVMMetadataRef;
}
extern "C" {
    pub fn LLVMInstructionSetDebugLoc(Inst: LLVMValueRef, Loc: LLVMMetadataRef);
}
extern "C" {
    pub fn LLVMGetMetadataKind(Metadata: LLVMMetadataRef) -> LLVMMetadataKind;
}
pub type LLVMDisasmContextRef = *mut ::std::os::raw::c_void;
pub type LLVMOpInfoCallback = ::std::option::Option<
    unsafe extern "C" fn(
        DisInfo: *mut ::std::os::raw::c_void,
        PC: u64,
        Offset: u64,
        Size: u64,
        TagType: ::std::os::raw::c_int,
        TagBuf: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpInfoSymbol1 {
    pub Present: u64,
    pub Name: *const ::std::os::raw::c_char,
    pub Value: u64,
}
#[test]
fn bindgen_test_layout_LLVMOpInfoSymbol1() {
    assert_eq!(
        ::std::mem::size_of::<LLVMOpInfoSymbol1>(),
        24usize,
        concat!("Size of: ", stringify!(LLVMOpInfoSymbol1))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOpInfoSymbol1>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMOpInfoSymbol1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLVMOpInfoSymbol1>())).Present as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOpInfoSymbol1),
            "::",
            stringify!(Present)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLVMOpInfoSymbol1>())).Name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOpInfoSymbol1),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLVMOpInfoSymbol1>())).Value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOpInfoSymbol1),
            "::",
            stringify!(Value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpInfo1 {
    pub AddSymbol: LLVMOpInfoSymbol1,
    pub SubtractSymbol: LLVMOpInfoSymbol1,
    pub Value: u64,
    pub VariantKind: u64,
}
#[test]
fn bindgen_test_layout_LLVMOpInfo1() {
    assert_eq!(
        ::std::mem::size_of::<LLVMOpInfo1>(),
        64usize,
        concat!("Size of: ", stringify!(LLVMOpInfo1))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOpInfo1>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMOpInfo1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLVMOpInfo1>())).AddSymbol as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOpInfo1),
            "::",
            stringify!(AddSymbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLVMOpInfo1>())).SubtractSymbol as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOpInfo1),
            "::",
            stringify!(SubtractSymbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLVMOpInfo1>())).Value as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOpInfo1),
            "::",
            stringify!(Value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLVMOpInfo1>())).VariantKind as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOpInfo1),
            "::",
            stringify!(VariantKind)
        )
    );
}
pub type LLVMSymbolLookupCallback = ::std::option::Option<
    unsafe extern "C" fn(
        DisInfo: *mut ::std::os::raw::c_void,
        ReferenceValue: u64,
        ReferenceType: *mut u64,
        ReferencePC: u64,
        ReferenceName: *mut *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char,
>;
extern "C" {
    pub fn LLVMCreateDisasm(
        TripleName: *const ::std::os::raw::c_char,
        DisInfo: *mut ::std::os::raw::c_void,
        TagType: ::std::os::raw::c_int,
        GetOpInfo: LLVMOpInfoCallback,
        SymbolLookUp: LLVMSymbolLookupCallback,
    ) -> LLVMDisasmContextRef;
}
extern "C" {
    pub fn LLVMCreateDisasmCPU(
        Triple: *const ::std::os::raw::c_char,
        CPU: *const ::std::os::raw::c_char,
        DisInfo: *mut ::std::os::raw::c_void,
        TagType: ::std::os::raw::c_int,
        GetOpInfo: LLVMOpInfoCallback,
        SymbolLookUp: LLVMSymbolLookupCallback,
    ) -> LLVMDisasmContextRef;
}
extern "C" {
    pub fn LLVMCreateDisasmCPUFeatures(
        Triple: *const ::std::os::raw::c_char,
        CPU: *const ::std::os::raw::c_char,
        Features: *const ::std::os::raw::c_char,
        DisInfo: *mut ::std::os::raw::c_void,
        TagType: ::std::os::raw::c_int,
        GetOpInfo: LLVMOpInfoCallback,
        SymbolLookUp: LLVMSymbolLookupCallback,
    ) -> LLVMDisasmContextRef;
}
extern "C" {
    pub fn LLVMSetDisasmOptions(DC: LLVMDisasmContextRef, Options: u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LLVMDisasmDispose(DC: LLVMDisasmContextRef);
}
extern "C" {
    pub fn LLVMDisasmInstruction(
        DC: LLVMDisasmContextRef,
        Bytes: *mut u8,
        BytesSize: u64,
        PC: u64,
        OutString: *mut ::std::os::raw::c_char,
        OutStringSize: size_t,
    ) -> size_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueError {
    _unused: [u8; 0],
}
pub type LLVMErrorRef = *mut LLVMOpaqueError;
pub type LLVMErrorTypeId = *const ::std::os::raw::c_void;
extern "C" {
    pub fn LLVMGetErrorTypeId(Err: LLVMErrorRef) -> LLVMErrorTypeId;
}
extern "C" {
    pub fn LLVMConsumeError(Err: LLVMErrorRef);
}
extern "C" {
    pub fn LLVMGetErrorMessage(Err: LLVMErrorRef) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMDisposeErrorMessage(ErrMsg: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn LLVMGetStringErrorTypeId() -> LLVMErrorTypeId;
}
pub const LLVMByteOrdering_LLVMBigEndian: LLVMByteOrdering = 0;
pub const LLVMByteOrdering_LLVMLittleEndian: LLVMByteOrdering = 1;
pub type LLVMByteOrdering = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueTargetData {
    _unused: [u8; 0],
}
pub type LLVMTargetDataRef = *mut LLVMOpaqueTargetData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueTargetLibraryInfotData {
    _unused: [u8; 0],
}
pub type LLVMTargetLibraryInfoRef = *mut LLVMOpaqueTargetLibraryInfotData;
extern "C" {
    pub fn LLVMInitializeAArch64TargetInfo();
}
extern "C" {
    pub fn LLVMInitializeAMDGPUTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeARMTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeBPFTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeHexagonTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeLanaiTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeMipsTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeMSP430TargetInfo();
}
extern "C" {
    pub fn LLVMInitializeNVPTXTargetInfo();
}
extern "C" {
    pub fn LLVMInitializePowerPCTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeRISCVTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeSparcTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeSystemZTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeWebAssemblyTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeX86TargetInfo();
}
extern "C" {
    pub fn LLVMInitializeXCoreTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeAVRTargetInfo();
}
extern "C" {
    pub fn LLVMInitializeAArch64Target();
}
extern "C" {
    pub fn LLVMInitializeAMDGPUTarget();
}
extern "C" {
    pub fn LLVMInitializeARMTarget();
}
extern "C" {
    pub fn LLVMInitializeBPFTarget();
}
extern "C" {
    pub fn LLVMInitializeHexagonTarget();
}
extern "C" {
    pub fn LLVMInitializeLanaiTarget();
}
extern "C" {
    pub fn LLVMInitializeMipsTarget();
}
extern "C" {
    pub fn LLVMInitializeMSP430Target();
}
extern "C" {
    pub fn LLVMInitializeNVPTXTarget();
}
extern "C" {
    pub fn LLVMInitializePowerPCTarget();
}
extern "C" {
    pub fn LLVMInitializeRISCVTarget();
}
extern "C" {
    pub fn LLVMInitializeSparcTarget();
}
extern "C" {
    pub fn LLVMInitializeSystemZTarget();
}
extern "C" {
    pub fn LLVMInitializeWebAssemblyTarget();
}
extern "C" {
    pub fn LLVMInitializeX86Target();
}
extern "C" {
    pub fn LLVMInitializeXCoreTarget();
}
extern "C" {
    pub fn LLVMInitializeAVRTarget();
}
extern "C" {
    pub fn LLVMInitializeAArch64TargetMC();
}
extern "C" {
    pub fn LLVMInitializeAMDGPUTargetMC();
}
extern "C" {
    pub fn LLVMInitializeARMTargetMC();
}
extern "C" {
    pub fn LLVMInitializeBPFTargetMC();
}
extern "C" {
    pub fn LLVMInitializeHexagonTargetMC();
}
extern "C" {
    pub fn LLVMInitializeLanaiTargetMC();
}
extern "C" {
    pub fn LLVMInitializeMipsTargetMC();
}
extern "C" {
    pub fn LLVMInitializeMSP430TargetMC();
}
extern "C" {
    pub fn LLVMInitializeNVPTXTargetMC();
}
extern "C" {
    pub fn LLVMInitializePowerPCTargetMC();
}
extern "C" {
    pub fn LLVMInitializeRISCVTargetMC();
}
extern "C" {
    pub fn LLVMInitializeSparcTargetMC();
}
extern "C" {
    pub fn LLVMInitializeSystemZTargetMC();
}
extern "C" {
    pub fn LLVMInitializeWebAssemblyTargetMC();
}
extern "C" {
    pub fn LLVMInitializeX86TargetMC();
}
extern "C" {
    pub fn LLVMInitializeXCoreTargetMC();
}
extern "C" {
    pub fn LLVMInitializeAVRTargetMC();
}
extern "C" {
    pub fn LLVMInitializeAArch64AsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeAMDGPUAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeARMAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeBPFAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeHexagonAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeLanaiAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeMipsAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeMSP430AsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeNVPTXAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializePowerPCAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeRISCVAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeSparcAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeSystemZAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeWebAssemblyAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeX86AsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeXCoreAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeAVRAsmPrinter();
}
extern "C" {
    pub fn LLVMInitializeAArch64AsmParser();
}
extern "C" {
    pub fn LLVMInitializeAMDGPUAsmParser();
}
extern "C" {
    pub fn LLVMInitializeARMAsmParser();
}
extern "C" {
    pub fn LLVMInitializeBPFAsmParser();
}
extern "C" {
    pub fn LLVMInitializeHexagonAsmParser();
}
extern "C" {
    pub fn LLVMInitializeLanaiAsmParser();
}
extern "C" {
    pub fn LLVMInitializeMipsAsmParser();
}
extern "C" {
    pub fn LLVMInitializeMSP430AsmParser();
}
extern "C" {
    pub fn LLVMInitializePowerPCAsmParser();
}
extern "C" {
    pub fn LLVMInitializeRISCVAsmParser();
}
extern "C" {
    pub fn LLVMInitializeSparcAsmParser();
}
extern "C" {
    pub fn LLVMInitializeSystemZAsmParser();
}
extern "C" {
    pub fn LLVMInitializeWebAssemblyAsmParser();
}
extern "C" {
    pub fn LLVMInitializeX86AsmParser();
}
extern "C" {
    pub fn LLVMInitializeAVRAsmParser();
}
extern "C" {
    pub fn LLVMInitializeAArch64Disassembler();
}
extern "C" {
    pub fn LLVMInitializeAMDGPUDisassembler();
}
extern "C" {
    pub fn LLVMInitializeARMDisassembler();
}
extern "C" {
    pub fn LLVMInitializeBPFDisassembler();
}
extern "C" {
    pub fn LLVMInitializeHexagonDisassembler();
}
extern "C" {
    pub fn LLVMInitializeLanaiDisassembler();
}
extern "C" {
    pub fn LLVMInitializeMipsDisassembler();
}
extern "C" {
    pub fn LLVMInitializeMSP430Disassembler();
}
extern "C" {
    pub fn LLVMInitializePowerPCDisassembler();
}
extern "C" {
    pub fn LLVMInitializeRISCVDisassembler();
}
extern "C" {
    pub fn LLVMInitializeSparcDisassembler();
}
extern "C" {
    pub fn LLVMInitializeSystemZDisassembler();
}
extern "C" {
    pub fn LLVMInitializeWebAssemblyDisassembler();
}
extern "C" {
    pub fn LLVMInitializeX86Disassembler();
}
extern "C" {
    pub fn LLVMInitializeXCoreDisassembler();
}
extern "C" {
    pub fn LLVMInitializeAVRDisassembler();
}
extern "C" {
    pub fn LLVMGetModuleDataLayout(M: LLVMModuleRef) -> LLVMTargetDataRef;
}
extern "C" {
    pub fn LLVMSetModuleDataLayout(M: LLVMModuleRef, DL: LLVMTargetDataRef);
}
extern "C" {
    pub fn LLVMCreateTargetData(StringRep: *const ::std::os::raw::c_char) -> LLVMTargetDataRef;
}
extern "C" {
    pub fn LLVMDisposeTargetData(TD: LLVMTargetDataRef);
}
extern "C" {
    pub fn LLVMAddTargetLibraryInfo(TLI: LLVMTargetLibraryInfoRef, PM: LLVMPassManagerRef);
}
extern "C" {
    pub fn LLVMCopyStringRepOfTargetData(TD: LLVMTargetDataRef) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMByteOrder(TD: LLVMTargetDataRef) -> LLVMByteOrdering;
}
extern "C" {
    pub fn LLVMPointerSize(TD: LLVMTargetDataRef) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn LLVMPointerSizeForAS(
        TD: LLVMTargetDataRef,
        AS: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn LLVMIntPtrType(TD: LLVMTargetDataRef) -> LLVMTypeRef;
}
extern "C" {
    pub fn LLVMIntPtrTypeForAS(TD: LLVMTargetDataRef, AS: ::std::os::raw::c_uint) -> LLVMTypeRef;
}
extern "C" {
    pub fn LLVMIntPtrTypeInContext(C: LLVMContextRef, TD: LLVMTargetDataRef) -> LLVMTypeRef;
}
extern "C" {
    pub fn LLVMIntPtrTypeForASInContext(
        C: LLVMContextRef,
        TD: LLVMTargetDataRef,
        AS: ::std::os::raw::c_uint,
    ) -> LLVMTypeRef;
}
extern "C" {
    pub fn LLVMSizeOfTypeInBits(
        TD: LLVMTargetDataRef,
        Ty: LLVMTypeRef,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn LLVMStoreSizeOfType(
        TD: LLVMTargetDataRef,
        Ty: LLVMTypeRef,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn LLVMABISizeOfType(TD: LLVMTargetDataRef, Ty: LLVMTypeRef)
        -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn LLVMABIAlignmentOfType(TD: LLVMTargetDataRef, Ty: LLVMTypeRef)
        -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn LLVMCallFrameAlignmentOfType(
        TD: LLVMTargetDataRef,
        Ty: LLVMTypeRef,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn LLVMPreferredAlignmentOfType(
        TD: LLVMTargetDataRef,
        Ty: LLVMTypeRef,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn LLVMPreferredAlignmentOfGlobal(
        TD: LLVMTargetDataRef,
        GlobalVar: LLVMValueRef,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn LLVMElementAtOffset(
        TD: LLVMTargetDataRef,
        StructTy: LLVMTypeRef,
        Offset: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn LLVMOffsetOfElement(
        TD: LLVMTargetDataRef,
        StructTy: LLVMTypeRef,
        Element: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueTargetMachine {
    _unused: [u8; 0],
}
pub type LLVMTargetMachineRef = *mut LLVMOpaqueTargetMachine;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMTarget {
    _unused: [u8; 0],
}
pub type LLVMTargetRef = *mut LLVMTarget;
pub const LLVMCodeGenOptLevel_LLVMCodeGenLevelNone: LLVMCodeGenOptLevel = 0;
pub const LLVMCodeGenOptLevel_LLVMCodeGenLevelLess: LLVMCodeGenOptLevel = 1;
pub const LLVMCodeGenOptLevel_LLVMCodeGenLevelDefault: LLVMCodeGenOptLevel = 2;
pub const LLVMCodeGenOptLevel_LLVMCodeGenLevelAggressive: LLVMCodeGenOptLevel = 3;
pub type LLVMCodeGenOptLevel = u32;
pub const LLVMRelocMode_LLVMRelocDefault: LLVMRelocMode = 0;
pub const LLVMRelocMode_LLVMRelocStatic: LLVMRelocMode = 1;
pub const LLVMRelocMode_LLVMRelocPIC: LLVMRelocMode = 2;
pub const LLVMRelocMode_LLVMRelocDynamicNoPic: LLVMRelocMode = 3;
pub const LLVMRelocMode_LLVMRelocROPI: LLVMRelocMode = 4;
pub const LLVMRelocMode_LLVMRelocRWPI: LLVMRelocMode = 5;
pub const LLVMRelocMode_LLVMRelocROPI_RWPI: LLVMRelocMode = 6;
pub type LLVMRelocMode = u32;
pub const LLVMCodeModel_LLVMCodeModelDefault: LLVMCodeModel = 0;
pub const LLVMCodeModel_LLVMCodeModelJITDefault: LLVMCodeModel = 1;
pub const LLVMCodeModel_LLVMCodeModelTiny: LLVMCodeModel = 2;
pub const LLVMCodeModel_LLVMCodeModelSmall: LLVMCodeModel = 3;
pub const LLVMCodeModel_LLVMCodeModelKernel: LLVMCodeModel = 4;
pub const LLVMCodeModel_LLVMCodeModelMedium: LLVMCodeModel = 5;
pub const LLVMCodeModel_LLVMCodeModelLarge: LLVMCodeModel = 6;
pub type LLVMCodeModel = u32;
pub const LLVMCodeGenFileType_LLVMAssemblyFile: LLVMCodeGenFileType = 0;
pub const LLVMCodeGenFileType_LLVMObjectFile: LLVMCodeGenFileType = 1;
pub type LLVMCodeGenFileType = u32;
extern "C" {
    pub fn LLVMGetFirstTarget() -> LLVMTargetRef;
}
extern "C" {
    pub fn LLVMGetNextTarget(T: LLVMTargetRef) -> LLVMTargetRef;
}
extern "C" {
    pub fn LLVMGetTargetFromName(Name: *const ::std::os::raw::c_char) -> LLVMTargetRef;
}
extern "C" {
    pub fn LLVMGetTargetFromTriple(
        Triple: *const ::std::os::raw::c_char,
        T: *mut LLVMTargetRef,
        ErrorMessage: *mut *mut ::std::os::raw::c_char,
    ) -> LLVMBool;
}
extern "C" {
    pub fn LLVMGetTargetName(T: LLVMTargetRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMGetTargetDescription(T: LLVMTargetRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMTargetHasJIT(T: LLVMTargetRef) -> LLVMBool;
}
extern "C" {
    pub fn LLVMTargetHasTargetMachine(T: LLVMTargetRef) -> LLVMBool;
}
extern "C" {
    pub fn LLVMTargetHasAsmBackend(T: LLVMTargetRef) -> LLVMBool;
}
extern "C" {
    pub fn LLVMCreateTargetMachine(
        T: LLVMTargetRef,
        Triple: *const ::std::os::raw::c_char,
        CPU: *const ::std::os::raw::c_char,
        Features: *const ::std::os::raw::c_char,
        Level: LLVMCodeGenOptLevel,
        Reloc: LLVMRelocMode,
        CodeModel: LLVMCodeModel,
    ) -> LLVMTargetMachineRef;
}
extern "C" {
    pub fn LLVMDisposeTargetMachine(T: LLVMTargetMachineRef);
}
extern "C" {
    pub fn LLVMGetTargetMachineTarget(T: LLVMTargetMachineRef) -> LLVMTargetRef;
}
extern "C" {
    pub fn LLVMGetTargetMachineTriple(T: LLVMTargetMachineRef) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMGetTargetMachineCPU(T: LLVMTargetMachineRef) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMGetTargetMachineFeatureString(
        T: LLVMTargetMachineRef,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMCreateTargetDataLayout(T: LLVMTargetMachineRef) -> LLVMTargetDataRef;
}
extern "C" {
    pub fn LLVMSetTargetMachineAsmVerbosity(T: LLVMTargetMachineRef, VerboseAsm: LLVMBool);
}
extern "C" {
    pub fn LLVMTargetMachineEmitToFile(
        T: LLVMTargetMachineRef,
        M: LLVMModuleRef,
        Filename: *mut ::std::os::raw::c_char,
        codegen: LLVMCodeGenFileType,
        ErrorMessage: *mut *mut ::std::os::raw::c_char,
    ) -> LLVMBool;
}
extern "C" {
    pub fn LLVMTargetMachineEmitToMemoryBuffer(
        T: LLVMTargetMachineRef,
        M: LLVMModuleRef,
        codegen: LLVMCodeGenFileType,
        ErrorMessage: *mut *mut ::std::os::raw::c_char,
        OutMemBuf: *mut LLVMMemoryBufferRef,
    ) -> LLVMBool;
}
extern "C" {
    pub fn LLVMGetDefaultTargetTriple() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMNormalizeTargetTriple(
        triple: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMGetHostCPUName() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMGetHostCPUFeatures() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn LLVMAddAnalysisPasses(T: LLVMTargetMachineRef, PM: LLVMPassManagerRef);
}
extern "C" {
    pub fn LLVMLinkInMCJIT();
}
extern "C" {
    pub fn LLVMLinkInInterpreter();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueGenericValue {
    _unused: [u8; 0],
}
pub type LLVMGenericValueRef = *mut LLVMOpaqueGenericValue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueExecutionEngine {
    _unused: [u8; 0],
}
pub type LLVMExecutionEngineRef = *mut LLVMOpaqueExecutionEngine;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueMCJITMemoryManager {
    _unused: [u8; 0],
}
pub type LLVMMCJITMemoryManagerRef = *mut LLVMOpaqueMCJITMemoryManager;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMMCJITCompilerOptions {
    pub OptLevel: ::std::os::raw::c_uint,
    pub CodeModel: LLVMCodeModel,
    pub NoFramePointerElim: LLVMBool,
    pub EnableFastISel: LLVMBool,
    pub MCJMM: LLVMMCJITMemoryManagerRef,
}
#[test]
fn bindgen_test_layout_LLVMMCJITCompilerOptions() {
    assert_eq!(
        ::std::mem::size_of::<LLVMMCJITCompilerOptions>(),
        24usize,
        concat!("Size of: ", stringify!(LLVMMCJITCompilerOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMMCJITCompilerOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMMCJITCompilerOptions))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LLVMMCJITCompilerOptions>())).OptLevel as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(OptLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LLVMMCJITCompilerOptions>())).CodeModel as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(CodeModel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LLVMMCJITCompilerOptions>())).NoFramePointerElim as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(NoFramePointerElim)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LLVMMCJITCompilerOptions>())).EnableFastISel as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(EnableFastISel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLVMMCJITCompilerOptions>())).MCJMM as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(MCJMM)
        )
    );
}
extern "C" {
    pub fn LLVMCreateGenericValueOfInt(
        Ty: LLVMTypeRef,
        N: ::std::os::raw::c_ulonglong,
        IsSigned: LLVMBool,
    ) -> LLVMGenericValueRef;
}
extern "C" {
    pub fn LLVMCreateGenericValueOfPointer(P: *mut ::std::os::raw::c_void) -> LLVMGenericValueRef;
}
extern "C" {
    pub fn LLVMCreateGenericValueOfFloat(Ty: LLVMTypeRef, N: f64) -> LLVMGenericValueRef;
}
extern "C" {
    pub fn LLVMGenericValueIntWidth(GenValRef: LLVMGenericValueRef) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn LLVMGenericValueToInt(
        GenVal: LLVMGenericValueRef,
        IsSigned: LLVMBool,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn LLVMGenericValueToPointer(GenVal: LLVMGenericValueRef) -> *mut ::std::os::raw::c_void;
}
extern "C" {
